# ASSIGNMENT 3

### Import pandas and read the data into a DataFrame. Print the first 5 rows of the DataFrame

In [12]:
import pandas as pd
df=pd.read_csv('padas_question.csv')
df.head(5)

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York

### Print the number of rows and columns in the DataFrame.

In [13]:
df.shape

(10, 6)

### Print the null value count

In [30]:
df.isnull().sum()

Name           0
Gender         0
Age            0
Height (cm)    0
Weight (kg)    0
City           0
dtype: int64

### Print the average age, height, and weight of the people in the DataFrame

In [22]:
average_age=df['Age'].mean()
print(average_age)

31.6

In [45]:
average_height=df['Height (cm)'].mean()
print(average_height)

175.0

In [46]:
average_weight=df['Weight (kg)'].mean()
print(average_weight)

68.9

In [53]:
df

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York
5    Frank    Male   40          190           85      Houston
6    Grace  Female   32          168           55      Chicago
7    Henry    Male   45          175           75  Los Angeles
8      Ivy  Female   26          172           63        Miami
9     Jack    Male   28          180           78     New York

### Print the name and city of the person who is the tallest in the DataFrame

In [56]:
tallest_index = df['Height (cm)'].idxmax()
tallest_name=df.loc[tallest_index,'Name']
tallest_city=df.loc[tallest_index,'City']
print("The tallest person name is",tallest_name)
print("The tallest person city is",tallest_city)

The tallest person name is Frank
The tallest person city is Houston

### Create a new column in the DataFrame called "BMI" that calculates the body mass index of each person. BMI iscalculated as weight (kg) divided by height (m) squared. Print the DataFrame with the new column.

In [59]:
df['BMI'] = df['Weight (kg)'] / (df['Height (cm)'] / 100) ** 2
df

      Name  Gender  Age  Height (cm)  Weight (kg)         City        BMI
0    Alice  Female   25          165           58     New York  21.303949
1      Bob    Male   30          180           80  Los Angeles  24.691358
2  Charlie    Male   35          175           70      Chicago  22.857143
3    Diana  Female   28          170           65        Miami  22.491349
4      Eva  Female   27          175           60     New York  19.591837
5    Frank    Male   40          190           85      Houston  23.545706
6    Grace  Female   32          168           55      Chicago  19.486961
7    Henry    Male   45          175           75  Los Angeles  24.489796
8      Ivy  Female   26          172           63        Miami  21.295295
9     Jack    Male   28          180           78     New York  24.074074

### Group the data by gender and print the average age, height, and weight of males and females separately

In [65]:
group_data = df.groupby('Gender')
average = group_data.agg({'Age': 'mean', 'Height (cm)': 'mean', 'Weight (kg)': 'mean'})
print(average)

         Age  Height (cm)  Weight (kg)
Gender
Female  27.6        170.0         60.2
Male    35.6        180.0         77.6

### Sort the data by age in ascending order and print the first 3 rows of the sorted DataFrame.

In [68]:
sorted = df.sort_values(by='Age', ascending=True)
print(sorted.head(3))

    Name  Gender  Age  Height (cm)  Weight (kg)      City        BMI
0  Alice  Female   25          165           58  New York  21.303949
8    Ivy  Female   26          172           63     Miami  21.295295
4    Eva  Female   27          175           60  New York  19.591837

### Filter the data to only include people who live in New York and print the resulting DataFrame.

In [73]:
Filtered_data=df[df['City']=='New York']
print(Filtered_data)

    Name  Gender  Age  Height (cm)  Weight (kg)      City        BMI
0  Alice  Female   25          165           58  New York  21.303949
4    Eva  Female   27          175           60  New York  19.591837
9   Jack    Male   28          180           78  New York  24.074074